      *****************************************************************
      *    CUSTOMER ARRAY                                             *
      *                                                               *
      *    NOTE: MAINTAIN ARRAY IN ALPHABETICAL ORDER BY CUSTOMER     *
      *          IDENTIFICATION (WCAR-CUSTOMER-ID)                    *
      *****************************************************************

       01  WS-CUSTOMER-ARRAY.
      *****************************************************************
      *    ENTRY 1                                                    *
      *****************************************************************
           05  FILLER                  PIC X(32)    VALUE
               'AMERICANFASTNERS'.
           05  FILLER                  PIC X(32)    VALUE SPACES.
           05  FILLER                  PIC X(64)    VALUE
               'AMERICAN FASTNERS, INC.'.
           05  FILLER                  PIC X(128)   VALUE
               '9129 E. US HIGHWAY 36'.
           05  FILLER                  PIC X(32)    VALUE
               'AVON'.
           05  FILLER                  PIC X(32)    VALUE
               'INDIANA'.
           05  FILLER                  PIC X(12)    VALUE
               '46123'.
           05  FILLER                  PIC X(64)    VALUE
               'AMERICAN FASTNERS, INC.'.
           05  FILLER                  PIC X(128)   VALUE
               '9129 E. US HIGHWAY 36'.
           05  FILLER                  PIC X(32)    VALUE
               'AVON'.
           05  FILLER                  PIC X(32)    VALUE
               'INDIANA'.
           05  FILLER                  PIC X(12)    VALUE
               '46123'.
           05  FILLER                  PIC X(128)   VALUE
               'INFO@AMFAST.COM'.

      *****************************************************************
      *    ENTRY 2                                                    *
      *****************************************************************
           05  FILLER                  PIC X(32)    VALUE
               'ANCHORFENCE'.
           05  FILLER                  PIC X(32)    VALUE SPACES.
           05  FILLER                  PIC X(64)    VALUE
               'ANCHOR FENCE WHOLESALERS OF MIAMI'.
           05  FILLER                  PIC X(128)   VALUE
               '3670 NW 79TH'.
           05  FILLER                  PIC X(32)    VALUE
               'MIAMI'.
           05  FILLER                  PIC X(32)    VALUE
               'FLORIDA'.
           05  FILLER                  PIC X(12)    VALUE
               '33147'.
           05  FILLER                  PIC X(64)    VALUE
               'ANCHOR FENCE WHOLESALERS OF MIAMI'.
           05  FILLER                  PIC X(128)   VALUE
               '3670 NW 79TH'.
           05  FILLER                  PIC X(32)    VALUE
               'MIAMI'.
           05  FILLER                  PIC X(32)    VALUE
               'FLORIDA'.
           05  FILLER                  PIC X(12)    VALUE
               '33147'.
           05  FILLER                  PIC X(128)   VALUE
               'INFO@ANCHORMIAMI.COM'.

      *****************************************************************
      *    ENTRY 3                                                    *
      *****************************************************************
           05  FILLER                  PIC X(32)    VALUE
               'ARROW'.
           05  FILLER                  PIC X(32)    VALUE SPACES.
           05  FILLER                  PIC X(64)    VALUE
               'ARROW INDUSTRIAL SUPPLY INC.'.
           05  FILLER                  PIC X(128)   VALUE
               '5761 CHANDLER COURT'.
           05  FILLER                  PIC X(32)    VALUE
               'WESTERVILLE'.
           05  FILLER                  PIC X(32)    VALUE
               'OHIO'.
           05  FILLER                  PIC X(12)    VALUE
               '43082'.
           05  FILLER                  PIC X(64)    VALUE
               'ARROW INDUSTRIAL SUPPLY INC.'.
           05  FILLER                  PIC X(128)   VALUE
               '5761 CHANDLER COURT'.
           05  FILLER                  PIC X(32)    VALUE
               'WESTERVILLE'.
           05  FILLER                  PIC X(32)    VALUE
               'OHIO'.
           05  FILLER                  PIC X(12)    VALUE
               '43082'.
           05  FILLER                  PIC X(128)   VALUE
               'INFO@BOLTSPLUS.COM'.

      *****************************************************************
      *    ENTRY 4                                                    *
      *****************************************************************
           05  FILLER                  PIC X(32)    VALUE
               'ATLANTIC'.
           05  FILLER                  PIC X(32)    VALUE SPACES.
           05  FILLER                  PIC X(64)    VALUE
               'ATLANTIC FASTENERS'.
           05  FILLER                  PIC X(128)   VALUE
               '49 HEYWOOD AVE'.
           05  FILLER                  PIC X(32)    VALUE
               'WEST SPRINGFIELD'.
           05  FILLER                  PIC X(32)    VALUE
               'MASSACHUSETTS'.
           05  FILLER                  PIC X(12)    VALUE
               '01090'.
           05  FILLER                  PIC X(64)    VALUE
               'ATLANTIC FASTENERS'.
           05  FILLER                  PIC X(128)   VALUE
               '49 HEYWOOD AVE'.
           05  FILLER                  PIC X(32)    VALUE
               'WEST SPRINGFIELD'.
           05  FILLER                  PIC X(32)    VALUE
               'MASSACHUSETTS'.
           05  FILLER                  PIC X(12)    VALUE
               '01090-1168'.
           05  FILLER                  PIC X(128)   VALUE
               'INFO@ATLANTICFASTNERS.COM'.

      *****************************************************************
      *    ENTRY 5                                                    *
      *****************************************************************
           05  FILLER                  PIC X(32)    VALUE
               'BESTBOLTS'.
           05  FILLER                  PIC X(32)    VALUE SPACES.
           05  FILLER                  PIC X(64)    VALUE
               'BEST BOLTS AND SUPPLIES'.
           05  FILLER                  PIC X(128)   VALUE
               '32395 CLINTON KEITH RD. B7 #242'.
           05  FILLER                  PIC X(32)    VALUE
               'WILDOMAR'.
           05  FILLER                  PIC X(32)    VALUE
               'CALIFORNIA'.
           05  FILLER                  PIC X(12)    VALUE
               '92595'.
           05  FILLER                  PIC X(64)    VALUE
               'BEST BOLTS AND SUPPLIES'.
           05  FILLER                  PIC X(128)   VALUE
               '32395 CLINTON KEITH RD. B7 #242'.
           05  FILLER                  PIC X(32)    VALUE
               'WILDOMAR'.
           05  FILLER                  PIC X(32)    VALUE
               'CALIFORNIA'.
           05  FILLER                  PIC X(12)    VALUE
               '92595'.
           05  FILLER                  PIC X(128)   VALUE
               'INFO@BESTBOLTS.COM'.

      *****************************************************************
      *    ENTRY 6                                                    *
      *****************************************************************
           05  FILLER                  PIC X(32)    VALUE
               'BOLTSNNUTS+'.
           05  FILLER                  PIC X(32)    VALUE SPACES.
           05  FILLER                  PIC X(64)    VALUE
               'BOLTS N NUTS PLUS'.
           05  FILLER                  PIC X(128)   VALUE
               '2011 MATILDA'.
           05  FILLER                  PIC X(32)    VALUE
               'HOUSTON'.
           05  FILLER                  PIC X(32)    VALUE
               'TEXAS'.
           05  FILLER                  PIC X(12)    VALUE
               '77039'.
           05  FILLER                  PIC X(64)    VALUE
               'BOLTS N NUTS PLUS'.
           05  FILLER                  PIC X(128)   VALUE
               '2011 MATILDA'.
           05  FILLER                  PIC X(32)    VALUE
               'HOUSTON'.
           05  FILLER                  PIC X(32)    VALUE
               'TEXAS'.
           05  FILLER                  PIC X(12)    VALUE
               '77039'.
           05  FILLER                  PIC X(128)   VALUE
               'INFO@BOLTSPLUS.COM'.

      *****************************************************************
      *    ENTRY 7                                                    *
      *****************************************************************
           05  FILLER                  PIC X(32)    VALUE
               'COMATED'.
           05  FILLER                  PIC X(32)    VALUE SPACES.
           05  FILLER                  PIC X(64)    VALUE
               'COMATED EDILIZIA S.P.A.'.
           05  FILLER                  PIC X(128)   VALUE
               'VIA GUASTALLA, 7'.
           05  FILLER                  PIC X(32)    VALUE
               'Z.I. GAMBARARA'.
           05  FILLER                  PIC X(32)    VALUE
               'MANTOVA (MN) ITALY'.
           05  FILLER                  PIC X(12)    VALUE
               '46100'.
           05  FILLER                  PIC X(64)    VALUE
               'COMATED EDILIZIA S.P.A.'.
           05  FILLER                  PIC X(128)   VALUE
               'VIA GUASTALLA, 7'.
           05  FILLER                  PIC X(32)    VALUE
               'Z.I. GAMBARARA'.
           05  FILLER                  PIC X(32)    VALUE
               'MANTOVA (MN) ITALY'.
           05  FILLER                  PIC X(12)    VALUE
               '46100'.
           05  FILLER                  PIC X(128)   VALUE
               'COMATED@COMATED.COM'.

      *****************************************************************
      *    ENTRY 8                                                    *
      *****************************************************************
           05  FILLER                  PIC X(32)    VALUE
               'DAMON HARDWARE'.
           05  FILLER                  PIC X(32)    VALUE SPACES.
           05  FILLER                  PIC X(64)    VALUE
               'DAMON HARDWARE'.
           05  FILLER                  PIC X(128)   VALUE
               '32395 GRAND RIVER AVE.'.
           05  FILLER                  PIC X(32)    VALUE
               'FARMINGTON'.
           05  FILLER                  PIC X(32)    VALUE
               'MICHIGAN'.
           05  FILLER                  PIC X(12)    VALUE
               '48595'.
           05  FILLER                  PIC X(64)    VALUE
               'DAMON HARDWARE'.
           05  FILLER                  PIC X(128)   VALUE
               '32395 GRAND RIVER AVE.'.
           05  FILLER                  PIC X(32)    VALUE
               'FARMINGTON'.
           05  FILLER                  PIC X(32)    VALUE
               'MICHIGAN'.
           05  FILLER                  PIC X(12)    VALUE
               '48595'.
           05  FILLER                  PIC X(128)   VALUE
               'ORDERS@DAMONHARDWARE.COM'.

      *****************************************************************
      *    ENTRY 9                                                    *
      *****************************************************************
           05  FILLER                  PIC X(32)    VALUE
               'FASTNERSINC'.
           05  FILLER                  PIC X(32)    VALUE SPACES.
           05  FILLER                  PIC X(64)    VALUE
               'FASTNERS, INC.'.
           05  FILLER                  PIC X(128)   VALUE
               '123 MAIN'.
           05  FILLER                  PIC X(32)    VALUE
               'SPOKANE'.
           05  FILLER                  PIC X(32)    VALUE
               'WASHINGTON'.
           05  FILLER                  PIC X(12)    VALUE
               '12345'.
           05  FILLER                  PIC X(64)    VALUE
               'FASTNERS, INC.'.
           05  FILLER                  PIC X(128)   VALUE
               '123 MAIN'.
           05  FILLER                  PIC X(32)    VALUE
               'SPOKANE'.
           05  FILLER                  PIC X(32)    VALUE
               'WASHINGTON'.
           05  FILLER                  PIC X(12)    VALUE
               '12345-1234'.
           05  FILLER                  PIC X(128)   VALUE
               'INFO@FASTNERSINC.COM'.

      *****************************************************************
      *    ENTRY 10                                                   *
      *****************************************************************
           05  FILLER                  PIC X(32)    VALUE
               'HENGSHUI'.
           05  FILLER                  PIC X(32)    VALUE SPACES.
           05  FILLER                  PIC X(64)    VALUE
               'HENGSHUI HENGZE FASTENING PART CO, LTD.'.
           05  FILLER                  PIC X(128)   VALUE
               'NO. 11 LIMIN RD.'.
           05  FILLER                  PIC X(32)    VALUE
               'HENGSHUI CITY'.
           05  FILLER                  PIC X(32)    VALUE
               'HEBEI, P.R. CHINA'.
           05  FILLER                  PIC X(12)    VALUE
               '05300'.
           05  FILLER                  PIC X(64)    VALUE
               'HENGSHUI HENGZE FASTENING PART CO, LTD.'.
           05  FILLER                  PIC X(128)   VALUE
               'NO. 11 LIMIN RD.'.
           05  FILLER                  PIC X(32)    VALUE
               'HENGSHUI CITY'.
           05  FILLER                  PIC X(32)    VALUE
               'HEBEI, P.R. CHINA'.
           05  FILLER                  PIC X(12)    VALUE
               '05300'.
           05  FILLER                  PIC X(128)   VALUE
               'SALES@HENGZE-FASTENING.COM'.

      *****************************************************************
      *    ENTRY 11                                                   *
      *****************************************************************
           05  FILLER                  PIC X(32)    VALUE
               'HOME DEPOT'.
           05  FILLER                  PIC X(32)    VALUE SPACES.
           05  FILLER                  PIC X(64)    VALUE
               'HOME DEPOT'.
           05  FILLER                  PIC X(128)   VALUE
               '12000 MIDDLEBELT RD.'.
           05  FILLER                  PIC X(32)    VALUE
               'LIVONIA'.
           05  FILLER                  PIC X(32)    VALUE
               'MICHIGAN'.
           05  FILLER                  PIC X(12)    VALUE
               '48243'.
           05  FILLER                  PIC X(64)    VALUE
               'HOME DEPOT'.
           05  FILLER                  PIC X(128)   VALUE
               '12000 MIDDLEBELT RD.'.
           05  FILLER                  PIC X(32)    VALUE
               'LIVONIA'.
           05  FILLER                  PIC X(32)    VALUE
               'MICHIGAN'.
           05  FILLER                  PIC X(12)    VALUE
               '48243'.
           05  FILLER                  PIC X(128)   VALUE
               'ORDERS@HOMEDEPOT.COM'.

      *****************************************************************
      *    ENTRY 12                                                   *
      *****************************************************************
           05  FILLER                  PIC X(32)    VALUE
               'POWERS'.
           05  FILLER                  PIC X(32)    VALUE SPACES.
           05  FILLER                  PIC X(64)    VALUE
               'POWERS AUSTRAILIA'.
           05  FILLER                  PIC X(128)   VALUE
               '4 ALBAN STREET'.
           05  FILLER                  PIC X(32)    VALUE
               'LIDCOMBE'.
           05  FILLER                  PIC X(32)    VALUE
               'NEW SOUTH WALES, AUSTRAILIA'.
           05  FILLER                  PIC X(12)    VALUE
               '2141'.
           05  FILLER                  PIC X(64)    VALUE
               'POWERS AUSTRAILIA'.
           05  FILLER                  PIC X(128)   VALUE
               '4 ALBAN STREET'.
           05  FILLER                  PIC X(32)    VALUE
               'LIDCOMBE'.
           05  FILLER                  PIC X(32)    VALUE
               'NEW SOUTH WALES, AUSTRAILIA'.
           05  FILLER                  PIC X(12)    VALUE
               '2141'.
           05  FILLER                  PIC X(128)   VALUE
               'NSW@POWERS.COM.AU'.

      *****************************************************************
      *    ENTRY 13                                                   *
      *****************************************************************
           05  FILLER                  PIC X(32)    VALUE
               'SPIRALOCK'.
           05  FILLER                  PIC X(32)    VALUE SPACES.
           05  FILLER                  PIC X(64)    VALUE
               'SPIRALOCK CORP.'.
           05  FILLER                  PIC X(128)   VALUE
               '25235 DEQUINDRE RD'.
           05  FILLER                  PIC X(32)    VALUE
               'MADISON HEIGHTS'.
           05  FILLER                  PIC X(32)    VALUE
               'MICHIGAN'.
           05  FILLER                  PIC X(12)    VALUE
               '48071'.
           05  FILLER                  PIC X(64)    VALUE
               'SPIRALOCK CORP.'.
           05  FILLER                  PIC X(128)   VALUE
               '25235 DEQUINDRE RD'.
           05  FILLER                  PIC X(32)    VALUE
               'MADISON HEIGHTS'.
           05  FILLER                  PIC X(32)    VALUE
               'MICHIGAN'.
           05  FILLER                  PIC X(12)    VALUE
               '48071'.
           05  FILLER                  PIC X(128)   VALUE
               'INFO@SPIRALOCK.COM'.

       01  WS-CUSTOMER-ARRAY-R         REDEFINES WS-CUSTOMER-ARRAY.
           05  WCAR-CUSTOMERS          OCCURS 13 TIMES.
               10  WCAR-CUSTOMER-ID    PIC X(32).
               10  WCAR-CUSTOMER-PASSWORD
                                       PIC X(32).
               10  WCAR-CUSTOMER-NAME  PIC X(64).
               10  WCAR-CUSTOMER-ADDRESS
                                       PIC X(128).
               10  WCAR-CUSTOMER-CITY  PIC X(32).
               10  WCAR-CUSTOMER-STATE PIC X(32).
               10  WCAR-CUSTOMER-ZIP   PIC X(12).
               10  WCAR-SHIP-NAME      PIC X(64).
               10  WCAR-SHIP-ADDRESS   PIC X(128).
               10  WCAR-SHIP-CITY      PIC X(32).
               10  WCAR-SHIP-STATE     PIC X(32).
               10  WCAR-SHIP-ZIP       PIC X(12).
               10  WCAR-CUSTOMER-EMAIL PIC X(128).
           EJECT