      ****************************************************************  00000100
      *****  IMS FUNCTION CODES                                         00000200
      ****************************************************************  00000300
       01  IMS-FUNCTION-CODES.                                          00000400
           05  GU                      PIC X(04)   VALUE 'GU  '.        00000500
           05  GN                      PIC X(04)   VALUE 'GN  '.        00000600
           05  GNP                     PIC X(04)   VALUE 'GNP '.        00000700
           05  GHU                     PIC X(04)   VALUE 'GHU '.        00000800
           05  GHN                     PIC X(04)   VALUE 'GHN '.        00000900
           05  GHNP                    PIC X(04)   VALUE 'GHNP'.        00001000
           05  ISRT                    PIC X(04)   VALUE 'ISRT'.        00002000
           05  DLET                    PIC X(04)   VALUE 'DLET'.        00003000
           05  REPL                    PIC X(04)   VALUE 'REPL'.        00004000
           05  PURG                    PIC X(04)   VALUE 'PURG'.        00005000
           05  SNAP                    PIC X(04)   VALUE 'SNAP'.        00006000
           05  CHNG                    PIC X(04)   VALUE 'CHNG'.        00007000
           05  CHKP                    PIC X(04)   VALUE 'CHKP'.        00008000
           05  XRST                    PIC X(04)   VALUE 'XRST'.        00009000
           05  DEQ                     PIC X(04)   VALUE 'DEQ '.        00010000
           05  ROLB                    PIC X(04)   VALUE 'ROLB'.        00020000
           05  ROLL                    PIC X(04)   VALUE 'ROLL'.        00030000
           05  LOG                     PIC X(04)   VALUE 'LOG '.        00040000
           05  GSCD                    PIC X(04)   VALUE 'GSCD'.        00050000
           05  STAT                    PIC X(04)   VALUE 'STAT'.        00060000