      ****************************************************************  00000100
      *****  PCB FOR THE ORDER DATABASE                                 00000200
      ****************************************************************  00000300
       01  ORDER-PCB1.                                                  00000402
           05  OP1-DBDNAME             PIC X(8).                        00000501
           05  OP1-SEG-LEVEL           PIC XX.                          00000601
           05  OP1-STATUS              PIC XX.                          00000701
           05  FILLER                  PIC X(8).                        00000800
           05  OP1-SEG-NAME            PIC X(8).                        00000901
           05  FILLER                  PIC X(8).                        00001000
           05  OP1-FEEDBACK-AREA       PIC X(80).                       00002001